{
  "posts": [
    {
      "date": "April 25, 2018",
      "photo": "img/hacsu/alexueki18.jpg",
      "body": "I came in Cornell as a “Major Dropout” -- an “Undecided” student. I was not sure what I wanted to do in the future, so I started exploring many fields and CS ultimately caught my attention.<br />Unlike other CS majors who pursue CS because they are talented at it, I struggled early on. I received poor scores in my 2xxx level classes and had to relearn most of the concepts later on in my studies. But because I was so fascinated with CS, I didn’t want to give up. I affiliated with the CS major, joined a robotics lab, and started projects on topics that inspired me. And I accepted that I will not be the best student in class; I was looking for inspiration, not a higher GPA. This mindset helped me discover what my specialties in CS are, and ultimately as a senior, they helped me find the job I wanted to pursue a future in.<br />If you ever find yourself struggling in a CS class, don’t freak out. Everyone has been in at least one CS course that they hated. And if you are like me, that’s almost all of them. But keep an open mind; there are so many possibilities with CS. All you need to do is to find your own. ",
      "person": "- Alex Ueki, Class of 2018"
    },
    {
      "date": "March 21, 2018",
      "photo": "img/hacsu/boahenecynoc20.jpg",
      "body": "I am an international student from Ghana.<br />Coming to Cornell, I had planned on majoring in Biological Engineering simply because it would allow me to explore an intersection between my interests in medicine and engineering. Ever since I was a young kid, my father wanted me to be a doctor.<br /> In my freshman year however, to fulfill my graduation requirements, I took CS1112, Intro to MATLAB, with Professor Daisy Fan. It was my first experience with Computer Science, but I enjoyed the mental challenge it provided. This was a new way of thinking for me and that experience marked a turning point because I decided to explore programming even more. Last summer, I took some CS courses, and worked with the design sub-team of AguaClara, an engineering project team at Cornell, to gain more hands-on programming experience. It was after that experience that I decided it was time to switch to Computer Science.<br /> When I told my dad about my decision to switch, he was a bit skeptical and suggested I stayed with Biological engineering which I was more familiar with. The concept of Computer Science is not very widespread in my country, Ghana, like it is in America. With limited resources and a very sparse number of tech companies available right now, many people still do not know what the prospects of Computer Science in Ghana are. It was after I received an internship offer from Google that my dad finally stopped questioning the validity of my decision to switch to Computer Science. He was very proud of me.<br />Now that Cornell has allowed me to appreciate the value and power of computer science, I am dedicating time to raise more awareness for computer science in Ghana and eventually, throughout Africa. Last winter, I connected with a few Ghanaian friends from Cornell, MIT, and Duke, and we organized a Hackathon for high school students in Ghana. This year we are aiming to get more company sponsorships, so we can expand the event to many other parts of Ghana. In the long term, we intend to replicate this in many African countries, to encourage more Africans - especially the younger generations- to explore the power of Computer Science. We know this is not going to be easy, but we will make it happen!",
      "person": "- Boahene Cynoc, Class of 2020"
    },
    {
      "date": "February 26, 2018",
      "photo": "img/hacsu/eashaankumar20.jpg",
      "body": "-“Know Your Limits”<br />Cornell is a very competitive University, and I know many of you have the same struggle as I do, we greedily tend to want so many different things at the same time, because we all are just ambitious college students.<br/>I am a new transfer student from UMD where I was the VP of their VR club. For those of you who have never experienced the struggle of transferring, I can guarantee you it was not easy. There were a lot of things I desired at the same time. I wanted to transfer, but I also wanted a summer internship. I wanted leadership experiences, but I also wanted to get involved in more research projects. I decided to challenge my limits, so I tried very hard and barely slept any for an entire semester. <br/>But as it turns out, it was simply just impossible to keep up with so many different things. Even though I was paying my whole efforts, in the end I was rejected by every single company I applied to, and I was constantly feeling anxious.<br/>I never regretted transferring to Cornell, but in the process I came to realize how important it is to know your limits and just focus on one thing. I am truly thankful for all the struggles I have faced in the past semester because they made me see where my limits lie, and where my interests are. In the future at Cornell, I will choose to focus more on research with Machine Learning and Data Science.<br/>Sometimes there are just sacrifices one needs to make. The amount of energy and resource a person can handle is not infinite. It is, crucial to know where your limits are, and find what your heart desires the most. Once you do, just focus on it, work hard at it, and make the best out of it!<br/> ",
      "person": "- Eashaan Kumar, Class of 2020"
    },
    {
      "date": "February 12, 2018",
      "photo": "img/hacsu/rongtan20.jpg",
      "body": "Last semester I was rejected by every single company I applied Summer Internship to.<br />Of course I was devastated, but I also knew I was not going to give up.<br/>During winter break when I visited China, I continued my intern search and I was lucky enough to be invited to an on-site with one of my favorite companies. After the interview, I patiently waited a few weeks for any results and it was the night before I was leaving for Cornell, I heard back from them. <br />I was having a “Goodbye” dinner with my families, then my phone rang, I checked and I saw the familiar sentence starting with “Thank you for your interest…”, again. I was very upset, but out of curiosity I wrote back to them, and sincerely asked why I was not the good fit.<br />Surprisingly, the company responded immediately, and told me they actually made a mistake! Because there were too many people interviewed on the same day, they mismatched my name with someone else. I was actually accepted!<br />Now that I am no longer “jobless”, I have two advice I would love to give to everyone who is still anxiously looking for a summer intern:<br />1. When you sadly receive an email starting with “Thank you for your interest”, always make sure you politely ask the company why you were not the good fit. <br/>2. Never. Never. Give. Up.",
      "person": "- Rong Tan, Class of 2020"
    },
    {
      "date": "November 6, 2017",
      "photo": "img/hacsu/anniecheng18.jpg",
      "body": "Don't drop Physics!",
      "person": "- Annie Cheng, Class of 2018"
    },
    {
      "date": "October 30, 2017",
      "photo": "img/hacsu/anmolkabra20.jpg",
      "body": "Coming to Cornell was my first time out of India.<br/>I grew up in city that not many people have heard of called Patna. I wasn’t originally planning on applying to a college abroad, but about a year before I would have taken the IIT exams, I decided that I would give applying to Cornell a shot.<br />Upon receiving my acceptance to Cornell, I shared the news with my grandfather. When I told him, he stopped saying his prayers, responded that he had never heard of Cornell, and then continued with his prayers. When I elaborated that I would be going to America to continue my studies, he came to a full stop to congratulate me. I told him that it would cost hundreds of thousands of dollars, but he assured that it would be managed even though we both believed that it was financially impossible.<br />Now that I reflect on that moment, I understand why he reacted the way he did. When he was in eighth grade, he was told that he could no longer continue his studies. Instead, he had to work to sustain the family business. His heart was broken, as he had always dreamed of continuing his education. As he got older, he learned to value education more than material wealth.</br>Just two months after I started studying at Cornell, my grandfather passed away.<br />My family and I have always held the highest regard for education. Until I came to the states, my family’s educational aspirations had always been held back. With my time at Cornell, I want to insure that my family will no longer have to make a decision between education and financial well being. I want to improve the quality education not only for my family, but also for future generations. I realize that people often lose track of their true goals to pursue materialistic ones. Everyone has a true mission in life, but the hard part is realizing what it is.",
      "person": "- Anmol Kabra, Class of 2020"
    },
    {
      "date": "October 23, 2017",
      "photo": "img/hacsu/priyankaboddu18.jpg",
      "body": "I have always wanted to be a doctor.<br />Entering Cornell I wanted to study biomedical engineering. When I took CS 1110 in the fall of my first year on campus, my goal was to finish my requirement and then forget about CS for the rest of college. That was my goal... until I started taking CS 1110 with Walker White. As I began to fall in love with computer science, I cared less and less about my BME classes. By sophomore year, I decided that I no longer wanted to pursue a major in BME. Instead, I planned to major in CS while also working towards my premed requirements. <br />Switching back and forth between orgo exams and CS projects was not always easy. But fortunately, with every project I worked on or exam I studied for, I had the full support of Cornell’s computer science community. <br />My advice for anyone wanting to pursue CS and a premed track is that you should be straightforward with yourself and others. Do things you like to do. By deciding to study two of my strongest interests, I have had the opportunity to work at the intersection of computer science and medicine - an opportunity I may not have had otherwise. <br />This is my last year at Cornell, and I wouldn’t have done my experience any other way. ",
      "person": "- Priyanka Boddu, Class of 2018"
    },
    {
      "date": "October 16, 2017",
      "photo": "img/hacsu/sheahunterbelsky18.jpg",
      "body": "I decided to pursue education after listening to guest lectures given by the Information Science department. I have always liked teaching (anyone who knows me knows that I am a TA for lots of classes). But I have always wanted to learn more about instruction from different perspectives - from elementary school students to adults, there is an entire spectrum of learning.<br />You never stop learning. Listening to the guest lecturers speak about their passion for education inspired me to continue my education beyond the classroom. Now, on my way to an Education minor, I am teaching members of the DeWitt Middle School film club. On campus, I am working with a staff member at the Statler on computer productivity and skills. It has been a very exciting time for me, and I can't wait to see what else is in store.",
      "person": "- Shea Hunter Belsky, Class of 2018"
    },
    {
      "date": "October 2, 2017",
      "photo": "img/hacsu/jonlee18.jpg",
      "body": "Switching out of pre-med during the second semester of junior year was not an easy decision. I was afraid of starting over.<br />I found myself grinding through late nights trying to compensate for my lost time. But with the amazing support I found in the CIS community, I knew that I had made the right decision. I received a great deal of mentorship early on and made some of my closest friends along the way. Their support led me to where I am today — and for that I am genuinely grateful. As a second semester senior, I want to give back to the community that accepted me with open arms by inviting anyone to reach out to me if they have questions or just want to chat over coffee.",
      "person": "- Jon Lee, Class of 2018"
    },
    {
      "date": "September 25, 2017",
      "photo": "img/hacsu/grace19.jpg",
      "body": "Not many people know this, but I was an active jazz singer from 2014 through 2015. In March 2016, I was diagnosed with spasmodic dysphonia. I was told it is something that I have to carry with me for the rest of my life, and the doctor emphasized that I could never sing again. It was one of the hardest things for me to get over. But in retrospect, it was a blessing in disguise. It taught me that being hopeful and having an optimistic attitude is something worth cultivating. My illness didn't limit me - it broadened my perspective of what I am capable of.",
      "person": "- Grace, Class of 2019"
    }
  ]
}
